Revit 2024 API
BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInMainModel Property
 A sweep in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ConfusingSweepByElementsInMainModel { get; }
Visual Basic
Public Shared ReadOnly Property ConfusingSweepByElementsInMainModel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ConfusingSweepByElementsInMainModel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace